### <예제 1-6> 행 인덱스/열 이름 변경

In [3]:
## 모듈 import
import pandas as pd

In [4]:
# 행 인덱스/열 이름 지정하여 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                  index=['준서', '예은'],
                  columns=['나이', '성별', '학교'])

# 행 인덱스, 열 이름 확인하기
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [5]:
# 열 이름 중, '나이' -> '연령' / '성별' -> '남녀' / '학교' -> '소속'
df = df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'})

# 변경 후 출력
display(df)

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [6]:
# df의 행 인덱스 중에서, '준서' -> '학생1' / '예은' -> '학생2'
df = df.rename(index={'준서':'학생1', '예은':'학생2'})

display(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

### <예제 1-8> 열 삭제

In [7]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [8]:
# 데이터 프레임 df를 복제하여 변수 df에 저장. df2의 1개 열 (column) 삭제
df2 = df.copy()
df2 = df2.drop('수학', axis=1)
print(df2)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [9]:
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2개 열(column) 삭제
df3 = df.copy()
df3 = df3.drop(['영어', '음악'], axis=1)
print(df3)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [10]:
# 데이터프레임 df를 복제하여 변수 df4에 저장. df4의 2개 열(column) 삭제
df4 = df.copy()
df4 = df4.drop(['영어', '음악'], axis='columns')
print(df4)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [11]:
# 데이터프레임 df를 복제하여 변수 df5에 저장. df5의 2개 열(column) 삭제
df5 = df.copy()
df5 = df5.drop(columns='수학')
print(df5)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

### <예제 1-11> 원소 선택

In [12]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df = df.set_index('이름')
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [13]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
print(a)
b = df.iloc[0, 2]
print(b)

85
85

In [14]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수)
c = df.loc['서준', ['음악', '체육']]
print(c)
d = df.iloc[0, [2, 3]]
print(d)
e = df.loc['서준', '음악':'체육']
print(e)
f = df.iloc[0, 2:]
print(f)

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [15]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수)
g = df.loc[['서준', '우현'], ['음악', '체육']]
print(g)
h = df.iloc[[0, 1], [2, 3]]
print(h)
i = df.loc['서준':'우현', '음악':'체육']
print(i)
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90

### <예제 1-13> 행 추가

In [16]:
display(df)

df13 = df.copy()
df13 = df13.reset_index()
df13.loc[3] = 0

display(df13)

df13.loc[4] = ['주영', 100, 100, 100, 100]
display(df13)

# 기존 행 복사
df13.loc['행6'] = df13.loc[3]
display(df13)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

   이름   수학   영어   음악   체육
0  서준   90   98   85  100
1  우현   80   89   95   90
2  인아   70   95  100   90
3   0    0    0    0    0
4  주영  100  100  100  100

    이름   수학   영어   음악   체육
0   서준   90   98   85  100
1   우현   80   89   95   90
2   인아   70   95  100   90
3    0    0    0    0    0
4   주영  100  100  100  100
행6   0    0    0    0    0

### <예제 1-14> 원소 값 변경

In [17]:
df14 = df.copy()

df14.loc['서준', ['음악','체육']] = 50, 30

display(df14)

    수학  영어   음악  체육
이름
서준  90  98   50  30
우현  80  89   95  90
인아  70  95  100  90

### <예제 1-17> 새로운 배열로 행 인덱스를 재지정

In [18]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [19]:
# 인덱스를 [r0, r1, r2, r3, r4]로 재지정
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [20]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index, fill_value=0)
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

### <예제 1-18> 정수형 위치 인덱스로 초기화

In [21]:
print(df)
# 기존 행인덱스 유지
ndf = df.reset_index()

print()
print(ndf)

# 행 인덱스 이름 변경
ndf = df.reset_index(names='kk')

print()
print(ndf)
# 기존 행인덱스 삭제
ndf = df.reset_index(drop=True)

print()
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

   kk  c0  c1  c2  c3  c4
0  r0   1   4   7  10  13
1  r1   2   5   8  11  14
2  r2   3   6   9  12  15

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

### <예제 1-24> 연산 메소드 사용 - 시리즈 연산

In [22]:
import numpy as np

# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

print(student1)
print()
print(student2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64

수학    80
국어    90
dtype: int64

In [23]:
sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)
sr_mod = student1.mod(student2, fill_value=0)

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div, sr_mod], 
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈', '나머지'])
print(result)

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf
나머지   0.0    10.000   NaN

### <예제 1-26> 데이터프레임끼리 더하기

In [ ]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.tail())          #마지막 5행을 표시
print('\n')
print(type(df))

In [ ]:
# 데이터프레임에 숫자 10 더하기
addition = df + 10
print(addition.tail())    #마지막 5행을 표시
print('\n')
print(type(addition))

In [ ]:
# 데이터프레임끼리 연산하기 (additon - df)
subtraction = addition - df
print(subtraction.tail())   #마지막 5행을 표시
print('\n')
print(type(subtraction))

In [ ]:
# 사칙연산 수행 (연산 메소드 사용)
sample1 = addition.tail()
sample2 = subtraction.tail().fillna(0.0)    # NaN을 0.0으로 대체

print(sample1)
print(sample2)

In [ ]:
df_add = sample1.add(sample2, fill_value=0)    #덧셈
df_sub = sample1.sub(sample2, fill_value=0)    #뺄셈
df_mul = sample1.mul(sample2, fill_value=0)    #곱셈
df_div = sample1.div(sample2, fill_value=0)    #나눗셈

print(df_add)
print(df_sub)
print(df_mul)
print(df_div)